-- MySQL dump 10.13  Distrib 5.1.41, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: xgm
-- ------------------------------------------------------
-- Server version	5.1.41-3ubuntu12.3

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `xgm_car`
--

DROP TABLE IF EXISTS `xgm_car`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_car` (
  `car_id` int(11) NOT NULL,
  `car_no` varchar(10) NOT NULL,
  `car_status` tinyint(4) NOT NULL COMMENT '1-¿ÉÓÃ£¬2-²»¿ÉÓÃ',
  `car_adddate` datetime NOT NULL,
  PRIMARY KEY (`car_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_car`
--

LOCK TABLES `xgm_car` WRITE;
/*!40000 ALTER TABLE `xgm_car` DISABLE KEYS */;
/*!40000 ALTER TABLE `xgm_car` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_cardinfo`
--

DROP TABLE IF EXISTS `xgm_cardinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_cardinfo` (
  `ci_id` int(11) NOT NULL AUTO_INCREMENT,
  `ci_name` varchar(20) NOT NULL,
  `ci_money` varchar(10) NOT NULL,
  `cview_id` int(11) DEFAULT NULL,
  `cview_name` varchar(20) NOT NULL,
  `ci_date` datetime NOT NULL,
  `ci_type` tinyint(4) NOT NULL COMMENT '1-Îª´¢Öµ¿¨£¬3-Îª´¢Îï¿¨',
  `ci_desc` text,
  `ci_mark` text,
  PRIMARY KEY (`ci_id`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_cardinfo`
--

LOCK TABLES `xgm_cardinfo` WRITE;
/*!40000 ALTER TABLE `xgm_cardinfo` DISABLE KEYS */;
INSERT INTO `xgm_cardinfo` VALUES (1,'父亲节好礼送','1000',1,'西瓜密码猫','2010-07-08 01:48:02',3,'xxx 1个\r\n特色天 2个\r\n大米 3金',''),(2,'母亲节大礼','1000',2,'红桃桃','2010-07-08 01:48:31',3,'发送到\r\n想想想\r\niiii\r\n','');
/*!40000 ALTER TABLE `xgm_cardinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_cardlib`
--

DROP TABLE IF EXISTS `xgm_cardlib`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_cardlib` (
  `ci_id` int(11) DEFAULT NULL,
  `cl_id` int(11) NOT NULL AUTO_INCREMENT,
  `co_id` int(11) DEFAULT NULL,
  `cl_num` varchar(12) NOT NULL,
  `cl_date` datetime NOT NULL,
  `cl_state` tinyint(4) NOT NULL DEFAULT '1' COMMENT '1-Îª¿ÉÓÃ£¬0-Îª²»¿ÉÓÃ',
  `cl_otime` datetime NOT NULL,
  `cl_expire` datetime NOT NULL,
  `ci_money` varchar(10) NOT NULL,
  `ci_balance` varchar(10) NOT NULL DEFAULT '0',
  `co_order` varchar(20) NOT NULL,
  PRIMARY KEY (`cl_id`)
) ENGINE=MyISAM AUTO_INCREMENT=163 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_cardlib`
--

LOCK TABLES `xgm_cardlib` WRITE;
/*!40000 ALTER TABLE `xgm_cardlib` DISABLE KEYS */;
INSERT INTO `xgm_cardlib` VALUES (1,1,1,'1','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,2,1,'2','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,3,1,'3','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,4,1,'5','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,5,1,'6','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,6,1,'7','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,7,1,'8','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,8,1,'9','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,9,1,'10','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,10,1,'11','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,11,1,'12','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,12,1,'13','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,13,1,'15','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,14,1,'16','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,15,1,'17','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,16,1,'18','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,17,1,'19','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,18,1,'20','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,19,1,'21','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,20,1,'22','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,21,1,'23','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,22,1,'25','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,23,1,'26','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,24,1,'27','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,25,1,'28','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,26,1,'29','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,27,1,'30','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,28,1,'31','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,29,1,'32','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,30,1,'33','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,31,1,'35','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,32,1,'36','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,33,1,'37','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,34,1,'38','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,35,1,'39','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,36,1,'50','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,37,1,'51','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,38,1,'52','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,39,1,'53','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,40,1,'55','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,41,1,'56','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,42,1,'57','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,43,1,'58','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,44,1,'59','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,45,1,'60','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,46,1,'61','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,47,1,'62','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,48,1,'63','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,49,1,'65','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,50,1,'66','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,51,1,'67','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,52,1,'68','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,53,1,'69','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,54,1,'70','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,55,1,'71','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,56,1,'72','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,57,1,'73','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,58,1,'75','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,59,1,'76','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,60,1,'77','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,61,1,'78','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,62,1,'79','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,63,1,'80','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,64,1,'81','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,65,1,'82','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,66,1,'83','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,67,1,'85','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,68,1,'86','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,69,1,'87','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,70,1,'88','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,71,1,'89','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,72,1,'90','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,73,1,'91','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,74,1,'92','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,75,1,'93','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,76,1,'95','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,77,1,'96','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,78,1,'97','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,79,1,'98','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,80,1,'99','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,81,1,'100','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,82,1,'101','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,83,1,'102','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,84,1,'103','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,85,1,'105','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,86,1,'106','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,87,1,'107','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,88,1,'108','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,89,1,'109','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,90,1,'110','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,91,1,'111','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,92,1,'112','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,93,1,'113','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,94,1,'115','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,95,1,'116','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,96,1,'117','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,97,1,'118','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,98,1,'119','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,99,1,'120','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,100,1,'121','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,101,1,'122','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,102,1,'123','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,103,1,'125','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,104,1,'126','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,105,1,'127','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,106,1,'128','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,107,1,'129','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,108,1,'130','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,109,1,'131','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,110,1,'132','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,111,1,'133','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,112,1,'135','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,113,1,'136','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,114,1,'137','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,115,1,'138','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,116,1,'139','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,117,1,'150','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,118,1,'151','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,119,1,'152','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,120,1,'153','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,121,1,'155','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,122,1,'156','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,123,1,'157','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,124,1,'158','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,125,1,'159','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,126,1,'160','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,127,1,'161','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,128,1,'162','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,129,1,'163','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,130,1,'165','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,131,1,'166','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,132,1,'167','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,133,1,'168','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,134,1,'169','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,135,1,'170','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,136,1,'171','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,137,1,'172','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,138,1,'173','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,139,1,'175','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,140,1,'176','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,141,1,'177','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,142,1,'178','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,143,1,'179','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,144,1,'180','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,145,1,'181','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,146,1,'182','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,147,1,'183','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,148,1,'185','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,149,1,'186','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,150,1,'187','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,151,1,'188','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,152,1,'189','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,153,1,'190','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,154,1,'191','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,155,1,'192','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,156,1,'193','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,157,1,'195','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,158,1,'196','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,159,1,'197','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,160,1,'198','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,161,1,'199','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522'),(1,162,1,'200','2010-07-08 01:51:10',1,'2010-07-08 02:03:56','2010-12-31 00:00:00','1000','1000','201007080151102522');
/*!40000 ALTER TABLE `xgm_cardlib` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_cardorder`
--

DROP TABLE IF EXISTS `xgm_cardorder`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_cardorder` (
  `co_id` int(11) NOT NULL AUTO_INCREMENT,
  `cu_id` int(11) DEFAULT NULL,
  `co_order` varchar(20) NOT NULL,
  `co_totalnums` int(11) NOT NULL DEFAULT '0',
  `co_total` varchar(10) NOT NULL,
  `co_ava` varchar(20) NOT NULL,
  `co_text` text NOT NULL COMMENT 'ÐòÁÐ»¯µÄ´æ·ÅÃ¿ÖÖ¿¨µÄÃû³Æ£¬Ã¿ÖÖ¿¨µÄÊýÁ¿£¬ÒÔ¼°¿¨µÄµ¥¼Û',
  `co_invoice` varchar(255) NOT NULL COMMENT 'Îª¿ÕÔò²»ÐèÒª·¢Æ±',
  `co_mark` text,
  `co_ctime` datetime NOT NULL,
  `cu_name` varchar(20) NOT NULL,
  `co_status` tinyint(4) NOT NULL DEFAULT '1' COMMENT '1-Î´³ö¿¨£¬3-³ö¿¨Íê³É£¬5-×÷·Ï',
  `co_stime` datetime NOT NULL COMMENT 'ÉèÖÃ¶©µ¥×´Ì¬µÄÊ±¼ä',
  `cview_name` varchar(20) NOT NULL,
  PRIMARY KEY (`co_id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_cardorder`
--

LOCK TABLES `xgm_cardorder` WRITE;
/*!40000 ALTER TABLE `xgm_cardorder` DISABLE KEYS */;
INSERT INTO `xgm_cardorder` VALUES (1,1,'201007080151102522',1000,'2000','2.00','a:10:{i:0;s:1:\"1\";i:1;s:18:\"父亲节好礼送\";i:2;s:4:\"1000\";i:3;s:1:\"1\";i:4;s:15:\"西瓜密码猫\";i:5;s:19:\"2010-07-08 01:48:02\";i:6;s:1:\"3\";i:7;s:37:\"xxx 1个\r\n特色天 2个\r\n大米 3金\";i:8;s:0:\"\";s:8:\"cardNums\";s:4:\"1000\";}','北京草客天下科技有限公司','这个公司好阿','2010-07-08 01:51:10','阿斗',3,'2010-07-08 02:03:56','父亲节好礼送');
/*!40000 ALTER TABLE `xgm_cardorder` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_carduser`
--

DROP TABLE IF EXISTS `xgm_carduser`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_carduser` (
  `cu_id` int(11) NOT NULL AUTO_INCREMENT,
  `cu_name` varchar(20) NOT NULL,
  `cu_py` varchar(40) NOT NULL,
  `cu_company` varchar(50) NOT NULL,
  `cu_sex` tinyint(4) NOT NULL,
  `cu_job` varchar(20) DEFAULT NULL,
  `cu_tel1` varchar(20) DEFAULT NULL,
  `cu_tel2` varchar(20) DEFAULT NULL,
  `cu_email` varchar(50) DEFAULT NULL,
  `cu_website` varchar(100) DEFAULT NULL,
  `cu_msn` varchar(50) DEFAULT NULL,
  `cu_qq` varchar(20) DEFAULT NULL,
  `cu_taobao` varchar(50) DEFAULT NULL,
  `cu_fetion` varchar(50) DEFAULT NULL,
  `cu_bank` varchar(20) DEFAULT NULL,
  `cu_bankname` varchar(20) DEFAULT NULL,
  `cu_mark` text,
  `cu_atime` datetime NOT NULL,
  PRIMARY KEY (`cu_id`),
  UNIQUE KEY `cnameemail` (`cu_name`,`cu_email`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_carduser`
--

LOCK TABLES `xgm_carduser` WRITE;
/*!40000 ALTER TABLE `xgm_carduser` DISABLE KEYS */;
INSERT INTO `xgm_carduser` VALUES (1,'阿斗','adou','草草天下',2,NULL,'15860745960',NULL,'lifenghuang15@163.com','http://qq.1716772817.com','lifenghuang15@163.com','fdsa ',NULL,NULL,'803480328402380328','中国银行','这个公司好阿','2010-07-08 01:51:10');
/*!40000 ALTER TABLE `xgm_carduser` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_cardview`
--

DROP TABLE IF EXISTS `xgm_cardview`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_cardview` (
  `cview_id` int(11) NOT NULL AUTO_INCREMENT,
  `cview_name` varchar(20) NOT NULL,
  `cview_desc` text,
  `cview_date` datetime NOT NULL,
  PRIMARY KEY (`cview_id`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_cardview`
--

LOCK TABLES `xgm_cardview` WRITE;
/*!40000 ALTER TABLE `xgm_cardview` DISABLE KEYS */;
INSERT INTO `xgm_cardview` VALUES (1,'西瓜密码猫','特色天','2010-07-08 01:46:33'),(2,'红桃桃','特色天信息','2010-07-08 01:47:12');
/*!40000 ALTER TABLE `xgm_cardview` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_goinfo`
--

DROP TABLE IF EXISTS `xgm_goinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_goinfo` (
  `go_id` int(11) DEFAULT NULL,
  `gl_id` int(11) DEFAULT NULL,
  `goi_nums` int(11) NOT NULL DEFAULT '0',
  `gl_name` varchar(30) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_goinfo`
--

LOCK TABLES `xgm_goinfo` WRITE;
/*!40000 ALTER TABLE `xgm_goinfo` DISABLE KEYS */;
/*!40000 ALTER TABLE `xgm_goinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_goodcat`
--

DROP TABLE IF EXISTS `xgm_goodcat`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_goodcat` (
  `gc_id` int(11) NOT NULL AUTO_INCREMENT,
  `gc_name` varchar(20) NOT NULL,
  `gc_time` datetime NOT NULL,
  `gc_pid` int(11) NOT NULL DEFAULT '0',
  `gc_mark` text NOT NULL,
  PRIMARY KEY (`gc_id`),
  UNIQUE KEY `cname` (`gc_name`)
) ENGINE=MyISAM AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_goodcat`
--

LOCK TABLES `xgm_goodcat` WRITE;
/*!40000 ALTER TABLE `xgm_goodcat` DISABLE KEYS */;
INSERT INTO `xgm_goodcat` VALUES (1,'水果','2010-07-08 02:12:08',0,''),(2,'农作物','2010-07-08 02:12:22',0,'农作物农作物农作物农作物农作物农作物农作物农作物'),(3,'糕点','2010-07-08 02:12:48',0,'糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点糕点'),(4,'饮料','2010-07-08 02:13:01',0,'饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料饮料'),(5,'苹果','2010-07-08 02:13:18',1,'苹果苹果苹果苹果苹果苹果苹果苹果苹果苹果'),(6,'香蕉','2010-07-08 02:13:29',1,''),(7,'其他','2010-07-08 02:13:37',0,''),(8,'其他费用','2010-07-08 02:13:52',7,''),(9,'大米','2010-07-08 02:14:02',2,''),(10,'生日蛋糕','2010-07-08 02:14:14',3,''),(11,'披萨','2010-07-08 02:14:26',3,''),(12,'可乐','2010-07-08 02:14:35',4,''),(13,'绿茶','2010-07-08 02:14:43',4,''),(14,'红茶','2010-07-08 02:14:52',4,''),(15,'啤酒','2010-07-08 02:25:41',4,'');
/*!40000 ALTER TABLE `xgm_goodcat` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_goodexception`
--

DROP TABLE IF EXISTS `xgm_goodexception`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_goodexception` (
  `ge_id` int(11) NOT NULL AUTO_INCREMENT,
  `go_id` int(11) DEFAULT NULL,
  `go_order` varchar(20) NOT NULL,
  PRIMARY KEY (`ge_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_goodexception`
--

LOCK TABLES `xgm_goodexception` WRITE;
/*!40000 ALTER TABLE `xgm_goodexception` DISABLE KEYS */;
/*!40000 ALTER TABLE `xgm_goodexception` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_goodin`
--

DROP TABLE IF EXISTS `xgm_goodin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_goodin` (
  `gi_id` int(11) NOT NULL AUTO_INCREMENT,
  `sp_id` int(11) DEFAULT NULL,
  `gl_edate` datetime NOT NULL,
  `gl_inprice` varchar(10) NOT NULL,
  `gl_adprice` varchar(10) NOT NULL,
  `gl_nums` int(11) NOT NULL DEFAULT '0',
  `gl_order` varchar(20) NOT NULL,
  `sp_name` varchar(50) NOT NULL,
  `gl_date` datetime NOT NULL,
  `gl_state` tinyint(4) NOT NULL DEFAULT '1' COMMENT '1-¿ÉÓÃ£¬0-²»¿ÉÓÃ ',
  `gl_leaves` int(11) NOT NULL DEFAULT '0' COMMENT '³ö¿âºóÊ£ÓàÊýÁ¿',
  `gl_name` varchar(30) NOT NULL,
  PRIMARY KEY (`gi_id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_goodin`
--

LOCK TABLES `xgm_goodin` WRITE;
/*!40000 ALTER TABLE `xgm_goodin` DISABLE KEYS */;
INSERT INTO `xgm_goodin` VALUES (1,1,'0000-00-00 00:00:00','0','0',2147483647,'000000','草客天下','2010-07-08 02:17:22',1,2147483647,'运费'),(2,1,'2010-09-21 00:00:00','5','10',10000,'1001001','草客天下','2010-07-08 02:19:09',1,10000,'红富士'),(3,1,'2012-01-01 00:00:00','34','54',100,'1001001','草客天下','2010-07-08 02:27:09',1,100,'青岛啤酒'),(4,1,'2012-01-01 00:00:00','10','20',200,'1001001','草客天下','2010-07-08 02:33:19',1,200,'泰国大米');
/*!40000 ALTER TABLE `xgm_goodin` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_goodlib`
--

DROP TABLE IF EXISTS `xgm_goodlib`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_goodlib` (
  `gl_id` int(11) NOT NULL AUTO_INCREMENT,
  `gl_name` varchar(30) NOT NULL,
  `gl_shortname` varchar(10) DEFAULT NULL,
  `gc_id` int(11) DEFAULT NULL,
  `gl_brand` varchar(20) NOT NULL,
  `gl_from` varchar(20) NOT NULL,
  `gl_pack` varchar(250) NOT NULL,
  `gl_per` varchar(10) NOT NULL,
  `gl_mprice` varchar(10) NOT NULL DEFAULT '0',
  `gl_warn` varchar(10) NOT NULL DEFAULT '0',
  `gl_warnper` tinyint(4) NOT NULL COMMENT '1-ÊýÁ¿£¬2-ÖØÁ¿',
  `gl_mark` text,
  `gl_type` tinyint(4) NOT NULL,
  `gl_w` varchar(10) NOT NULL,
  `gl_net` varchar(10) NOT NULL,
  `gl_leaves` int(11) NOT NULL DEFAULT '0',
  `gl_isspec` tinyint(4) NOT NULL DEFAULT '0' COMMENT '1-ÎªÌØ¼Û£¬0-·ÇÌØ¼Û',
  PRIMARY KEY (`gl_id`),
  UNIQUE KEY `gname` (`gl_name`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_goodlib`
--

LOCK TABLES `xgm_goodlib` WRITE;
/*!40000 ALTER TABLE `xgm_goodlib` DISABLE KEYS */;
INSERT INTO `xgm_goodlib` VALUES (1,'运费','yf',8,'','','无','个','0','0',1,'无',7,'','',2147483647,1),(2,'红富士','hfs',5,'松下','日本','精装','kg','10','10',3,'无',1,'40','30',10000,0),(3,'青岛啤酒','qd',15,'青岛','北京','精品','箱','5','100',1,NULL,4,'','',100,0),(4,'泰国大米','tgdm',9,'泰新','泰国','袋装','kg','20','100',3,NULL,2,'6','5',200,0);
/*!40000 ALTER TABLE `xgm_goodlib` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_goodorder`
--

DROP TABLE IF EXISTS `xgm_goodorder`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_goodorder` (
  `go_id` int(11) NOT NULL AUTO_INCREMENT,
  `ou_id` int(11) NOT NULL,
  `go_order` varchar(20) NOT NULL,
  `go_date` datetime NOT NULL,
  `ou_username` varchar(20) NOT NULL,
  `go_status` tinyint(4) NOT NULL COMMENT '1-Î´ÅäËÍ£¬2-ÅäËÍÍê³É£¬3-×÷·Ï£¬4-ÍË»õ£¬5-»»»õ',
  `cl_id` int(11) NOT NULL,
  `go_sdate` datetime NOT NULL,
  `go_mtype` tinyint(4) NOT NULL COMMENT '1-Ë¾»ú´úÊÕ£¬2-Ö§¸¶±¦£¬3-ÆäËû',
  `go_mark` text NOT NULL,
  `s_sender` varchar(20) NOT NULL,
  `s_id` int(11) NOT NULL,
  `car_no` varchar(10) NOT NULL,
  `car_id` int(11) NOT NULL,
  `go_sendmoney` varchar(10) NOT NULL,
  `go_type` tinyint(4) NOT NULL COMMENT '1-´¢Îï¿¨¶©µ¥£¬2-´¢Öµ¿¨¶©µ¥£¬3-ÁãÉ¢ÅäËÍµ¥£¬4-²¹ËÍÅäËÍµ¥£¬5-Í¶Ëß²¹ËÍ',
  `ou_truename` varchar(20) NOT NULL,
  `ou_oneaddress` text NOT NULL COMMENT 'ÐòÁÐ»¯µÄÊÕ»õÈËÐÅÏ¢',
  `go_mtmark` varchar(120) NOT NULL,
  `go_allprice` varchar(8) NOT NULL,
  `go_oprice` varchar(8) NOT NULL,
  PRIMARY KEY (`go_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_goodorder`
--

LOCK TABLES `xgm_goodorder` WRITE;
/*!40000 ALTER TABLE `xgm_goodorder` DISABLE KEYS */;
/*!40000 ALTER TABLE `xgm_goodorder` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_inorder`
--

DROP TABLE IF EXISTS `xgm_inorder`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_inorder` (
  `io_id` int(11) NOT NULL AUTO_INCREMENT,
  `io_no` varchar(50) NOT NULL,
  `io_adate` datetime NOT NULL,
  `io_date` date NOT NULL,
  `io_total` float NOT NULL,
  `io_mark` text NOT NULL,
  PRIMARY KEY (`io_id`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_inorder`
--

LOCK TABLES `xgm_inorder` WRITE;
/*!40000 ALTER TABLE `xgm_inorder` DISABLE KEYS */;
INSERT INTO `xgm_inorder` VALUES (1,'000000','2010-07-08 02:15:50','2010-07-08',0,'作为其他用的'),(2,'1001001','2010-07-08 02:31:30','2010-07-08',30000,'');
/*!40000 ALTER TABLE `xgm_inorder` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_orderuser`
--

DROP TABLE IF EXISTS `xgm_orderuser`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_orderuser` (
  `ou_id` int(11) NOT NULL AUTO_INCREMENT,
  `ou_username` varchar(20) NOT NULL,
  `ou_truename` varchar(20) NOT NULL,
  `ou_pinyin` varchar(20) NOT NULL,
  `ou_phone` varchar(18) NOT NULL,
  `ou_tel` varchar(20) NOT NULL,
  `ou_total` varchar(10) NOT NULL DEFAULT '0',
  `ou_address` text COMMENT 'ÐòÁÐ»¯´æ·ÅµÄÊÕ»õÇåµ¥',
  `ou_date` datetime NOT NULL,
  `ou_email` varchar(120) NOT NULL,
  PRIMARY KEY (`ou_id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_orderuser`
--

LOCK TABLES `xgm_orderuser` WRITE;
/*!40000 ALTER TABLE `xgm_orderuser` DISABLE KEYS */;
INSERT INTO `xgm_orderuser` VALUES (1,'','陈志敏','chenzhimin','13606936705','8780975','0',NULL,'0000-00-00 00:00:00','fengyue15@163.com');
/*!40000 ALTER TABLE `xgm_orderuser` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_sender`
--

DROP TABLE IF EXISTS `xgm_sender`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_sender` (
  `s_id` int(11) NOT NULL AUTO_INCREMENT,
  `s_sender` varchar(20) NOT NULL,
  `s_status` tinyint(4) NOT NULL DEFAULT '1' COMMENT '1-¿ÉÓÃ£¬2-Îª²»¿ÉÓÃ',
  `s_addtime` datetime NOT NULL,
  PRIMARY KEY (`s_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_sender`
--

LOCK TABLES `xgm_sender` WRITE;
/*!40000 ALTER TABLE `xgm_sender` DISABLE KEYS */;
/*!40000 ALTER TABLE `xgm_sender` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `xgm_supplier`
--

DROP TABLE IF EXISTS `xgm_supplier`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `xgm_supplier` (
  `sp_id` int(11) NOT NULL AUTO_INCREMENT,
  `sp_name` varchar(50) NOT NULL,
  `sp_conner1` varchar(20) NOT NULL,
  `sp_conner2` varchar(20) NOT NULL,
  `sp_c1tel1` varchar(20) NOT NULL,
  `sp_c1tel2` varchar(20) NOT NULL,
  `sp_c2tel1` varchar(20) NOT NULL,
  `sp_c2tel2` varchar(20) NOT NULL,
  `sp_manager` varchar(20) NOT NULL,
  `sp_manmobile` varchar(20) NOT NULL,
  `sp_manmsn` varchar(25) NOT NULL,
  `sp_manqq` varchar(15) NOT NULL,
  `sp_mantaobao` varchar(20) NOT NULL,
  `sp_manfetion` varchar(20) NOT NULL,
  `sp_office` varchar(80) NOT NULL,
  `sp_svn` varchar(80) NOT NULL,
  `sp_website` varchar(120) NOT NULL,
  `sp_email` varchar(60) NOT NULL,
  `sp_bankno` varchar(25) NOT NULL,
  `sp_bankname` varchar(20) NOT NULL,
  `sp_product` text,
  `sp_mark` text,
  `sp_time` datetime NOT NULL,
  PRIMARY KEY (`sp_id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `xgm_supplier`
--

LOCK TABLES `xgm_supplier` WRITE;
/*!40000 ALTER TABLE `xgm_supplier` DISABLE KEYS */;
INSERT INTO `xgm_supplier` VALUES (1,'草客天下','soone','fdsa','8780975','423432','12345','21313','陈志敏','13606936705','fengyue15@163.com','','','','发动机阿斯兰附近的撒了局了解到翻','I donnt know','http://blog.caokee.com','fengyue15@163.com','招商银行','32408048302843028403','特色他送的防盗萨',NULL,'2010-07-08 01:45:43');
/*!40000 ALTER TABLE `xgm_supplier` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2010-07-08  3:14:55
